---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Rounding
source: html/2f5d4eb9-6eb3-0aa6-3baf-9d50d2edb03b.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Rounding Property

Increment to which numeric values of analysis results are rounded in diagram.

## Syntax (C#)
```csharp
public double Rounding { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: rounding is not positive